Documents/Renault_CRM_ВыдачаАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ВыдачаАвтомобиля</Name>
			<BasedOn>
				<xr:Item>Document.Renault_CRM_ЗаявкаНаСервис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыСостоянийДокументовАвтосервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисСтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисСтатусыРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СтатусыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПаузы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_АвтосервисВидыПрочейЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_СтатусыЗанятостиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_СтатусыЗанятостиСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ЗанятостьСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПричиныЗанятостиСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримерноеВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СоставРаботПоЭтапам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СоставРаботПоЭтапам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаЗапчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ВыполнениеТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ВыполнениеТО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СкоростьПробега</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПланПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыТО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_ЗанятостьСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ЗанятостьСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_CRM_ВыдачаАвтомобиля/Ext/ObjectModule.bsl
// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда
		VIN = ДанныеЗаполнения.VIN;
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_CRM_ВыдачаАвтомобиля.Ссылка,
	//|	Renault_CRM_ВыдачаАвтомобиля.ВремяНачала,
	//|	Renault_CRM_ВыдачаАвтомобиля.ВремяОкончания
	//|ИЗ
	//|	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	//|ГДЕ
	//|	Renault_CRM_ВыдачаАвтомобиля.Машиноместо = &Машиноместо
	//|	И Renault_CRM_ВыдачаАвтомобиля.Ссылка <> &Ссылка";
	//Запрос.УстановитьПараметр("Машиноместо", Машиноместо);
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Если (ВремяНачала > Выборка.ВремяНачала И ВремяНачала < Выборка.ВремяОкончания) ИЛИ
	//		(ВремяОкончания > Выборка.ВремяНачала И ВремяОкончания < Выборка.ВремяОкончания) Тогда
	//		Сообщить("Есть пересечения с существующим документом:" + Выборка.Ссылка);
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_АвтосервисПланРабот.РабочийДокумент КАК Ссылка,
	//|	Renault_АвтосервисПланРабот.ВремяНачала,
	//|	Renault_АвтосервисПланРабот.ВремяОкончания,
	//|	Renault_АвтосервисПланОперативный.ВремяНачала КАК ВремяНачалаПлан,
	//|	Renault_АвтосервисПланОперативный.ВремяОкончания КАК ВремяОкончанияПлан,
	//|	Renault_АвтосервисФактОперативный.ВремяНачала КАК ВремяНачалаФакт,
	//|	Renault_АвтосервисФактОперативный.ВремяОкончания КАК ВремяОкончанияФакт
	//|ИЗ
	//|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланОперативный КАК Renault_АвтосервисПланОперативный
	//|	ПО Renault_АвтосервисПланОперативный.РабочийДокумент = Renault_АвтосервисПланРабот.РабочийДокумент
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисФактОперативный КАК Renault_АвтосервисФактОперативный
	//|	ПО Renault_АвтосервисФактОперативный.РабочийДокумент = Renault_АвтосервисПланРабот.РабочийДокумент
	//|ГДЕ
	//|	Renault_АвтосервисПланРабот.РабочийДокумент <> &РабочийДокумент
	//|	И Renault_АвтосервисПланРабот.ДилерскийЦентр = &ДилерскийЦентр
	//|	И Renault_АвтосервисПланРабот.Цех = &Цех";
	//Запрос.УстановитьПараметр("Цех", Машиноместо);
	//Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	//Запрос.УстановитьПараметр("РабочийДокумент", ЭтотОбъект.Ссылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ПоказалиСообщиние = ЛОЖЬ;
	//
	//Пока Выборка.Следующий() Цикл
	//	// если нет факт-плана и опер.плана тогда
	//	#Если Клиент Тогда
	//	
	//	Если НЕ (ЗначениеЗаполнено(Выборка.ВремяНачалаФакт) ИЛИ ЗначениеЗаполнено(Выборка.ВремяНачалаПлан)) Тогда
	//		Если (ВремяНачала > Выборка.ВремяНачала И ВремяНачала < Выборка.ВремяОкончания) ИЛИ
	//			(ВремяОкончания > Выборка.ВремяНачала И ВремяОкончания < Выборка.ВремяОкончания) Тогда
	//			Если НЕ ПоказалиСообщиние Тогда
	//			ПоказалиСообщиние = ИСТИНА;
	//				Если Вопрос(("Есть пересечения с существующим документом:" + Выборка.Ссылка), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
	//					
	//					Отказ = Истина;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	//Если есть план или факт
	//	Иначе
	//		// если есть факт
	//		Если ЗначениеЗаполнено(Выборка.ВремяНачалаФакт) Тогда
	//			Если (ВремяНачала > Выборка.ВремяНачалаФакт И ВремяНачала < Выборка.ВремяОкончанияФакт) ИЛИ
	//				(ВремяОкончания > Выборка.ВремяНачалаФакт И ВремяОкончания < Выборка.ВремяОкончанияФакт) Тогда
	//				Если НЕ ПоказалиСообщиние Тогда
	//				ПоказалиСообщиние = ИСТИНА;
	//					Если Вопрос(("Есть пересечения с существующим документом:" + Выборка.Ссылка), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
	//						
	//						Отказ = Истина;
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//		// если есть план
	//		Если ЗначениеЗаполнено(Выборка.ВремяНачалаПлан) Тогда
	//			Если (ВремяНачала > Выборка.ВремяНачалаПлан И ВремяНачала < Выборка.ВремяОкончанияПлан) ИЛИ
	//				(ВремяОкончания > Выборка.ВремяНачалаПлан И ВремяОкончания < Выборка.ВремяОкончанияПлан) Тогда
	//				Если НЕ ПоказалиСообщиние Тогда
	//				ПоказалиСообщиние = ИСТИНА;
	//					Если Вопрос(("Есть пересечения с существующим документом:" + Выборка.Ссылка), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
	//						
	//						Отказ = Истина;
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	#КонецЕсли
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	#Если Клиент Тогда
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		
		//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
		//	
		//	Попытка
		//		
		//		АвтоОб = Автомобиль.Ссылка.ПолучитьОбъект();
		//		
		//		Выполнить("ГосНомер	 = АвтоОб.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер)");
		//		//Пробег		 = АвтоОб.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		//		
		//	Исключение
		//		
		//		//Сообщить("Не удалось прочитать данные автомобиля: " + ОписаниеОшибки());
		//		
		//	КонецПопытки;
		//	
		//Иначе
			
		Выполнить("ГосНомер	 = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер)");
			//Пробег		 = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Элемент.ТекущиеДанные.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			
		//КонецЕсли;
		
	КонецЕсли;
	
	#КонецЕсли
	
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВыдачаНачата Тогда
	
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаНачата;
		Запись.Записать();
		
		НаборПланОперативный = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПланОперативный.Отбор.РабочийДокумент.Установить(Ссылка);
		НаборПланОперативный.Прочитать();
		НаборПланОперативный.Очистить();
		
		Запись = НаборПланОперативный.Добавить();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Период = ТекущаяДата();
		Запись.Обращение = Обращение;
		Запись.РабочийДокумент = Ссылка;
		Запись.ЭтапРабот = 1;
		Запись.Цех = Машиноместо;
		Запись.ВремяНачала = ТекущаяДата();
		//Длительность = Выборка.ВремяОкончания - Выборка.ВремяНачала;
		Запись.ВремяОкончания = ТекущаяДата() + 1200;
		Запись.Длительность = 1/3;
		//Запись.Записать();
		НаборПланОперативный.Записать();
		
		Сотрудник = ЭтотОбъект.Машиноместо;
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Занят;
		Запись.Период = ТекущаяДата();
		Запись.ПричинаЗанятости = Перечисления.CRM_ПричиныЗанятостиСотрудника.Выдача;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДилерскийЦентр.ДлительностьВыдачи) Тогда
			
			Длительность = ЭтотОбъект.ДилерскийЦентр.ДлительностьВыдачи*60;
			
		Иначе
		
			Длительность = 1200;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВремяОкончания) Тогда
			
			Запись.ПримерноеВремяОкончания = ЭтотОбъект.ВремяОкончания;
			
		Иначе
			
			Запись.ПримерноеВремяОкончания = ТекущаяДата() + Длительность;
			
		КонецЕсли;
		
		Запись.Записать();
		
	//какой статус для "свободен" пока не придумал, пусть будет так:	
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
		Запись.Записать();
		
		НаборПлан = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПлан.Отбор.РабочийДокумент.Установить(Ссылка);
		НаборПлан.Прочитать();
		НаборПлан.Очистить();
		НаборПлан.Записать();
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Свободен;
		Запись.Период = ТекущаяДата();
		
		Запись.Записать();
		
	КонецЕсли;
	
	// Воробьев Д.А. 06.10.2016 16:40:41 +++
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен
		И Не ПометкаУдаления Тогда
		
		МассивЗаявок = НайтиСвязанныеЗаявкиНаСервис();
		
		Для каждого мЗаявкаНаСервис Из МассивЗаявок Цикл
		
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Сотрудник", Машиноместо);
			Запрос.УстановитьПараметр("ЗаявкаНаСервис", мЗаявкаНаСервис);
			
			// Если есть заказ-наряд, то считаем его итоговым документом
			Если Не ЗначениеЗаполнено(мЗаявкаНаСервис.ЗаказНаряд) Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Работа КАК РаботаЗапчасть,
				|	СУММА(Renault_CRM_ЗаявкаНаСервисРаботы.Сумма) КАК Сумма,
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка КАК ЗаявкаНаСервис,
				|	&Сотрудник КАК Сотрудник,
				|	3 КАК Этап,
				|	ИСТИНА КАК ЭтоРабота
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Renault_CRM_ЗаявкаНаСервисРаботы
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка = &ЗаявкаНаСервис
				|
				|СГРУППИРОВАТЬ ПО
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Работа,
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаСервисТовары.Номенклатура,
				|	СУММА(Renault_CRM_ЗаявкаНаСервисТовары.Сумма),
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка,
				|	&Сотрудник,
				|	3,
				|	ЛОЖЬ
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаСервис.Товары КАК Renault_CRM_ЗаявкаНаСервисТовары
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка = &ЗаявкаНаСервис
				|
				|СГРУППИРОВАТЬ ПО
				|	Renault_CRM_ЗаявкаНаСервисТовары.Номенклатура,
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка";
				
			Иначе
				
				Запрос.УстановитьПараметр("ЗаказНаряд", мЗаявкаНаСервис.ЗаказНаряд);
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказНарядТовары.Номенклатура КАК РаботаЗапчасть,
				|	СУММА(ЗаказНарядТовары.СуммаВсего) КАК Сумма,
				|	&Сотрудник КАК Сотрудник,
				|	3 КАК Этап,
				|	&ЗаявкаНаСервис,
				|	ЛОЖЬ КАК ЭтоРабота
				|ИЗ
				|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
				|ГДЕ
				|	ЗаказНарядТовары.Ссылка = &ЗаказНаряд
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНарядТовары.Номенклатура
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаказНарядРаботы.Работа,
				|	СУММА(ЗаказНарядРаботы.СуммаВсего),
				|	&Сотрудник,
				|	3,
				|	&ЗаявкаНаСервис,
				|	ИСТИНА
				|ИЗ
				|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
				|ГДЕ
				|	ЗаказНарядРаботы.Ссылка = &ЗаказНаряд
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНарядРаботы.Работа";
			
			КонецЕсли;
			
			НаборЗаписейПродажиСервиса = РегистрыСведений.Renault_СоставРаботПоЭтапам.СоздатьНаборЗаписей();
			НаборЗаписейПродажиСервиса.Отбор.Этап.Установить(3);
			НаборЗаписейПродажиСервиса.Отбор.ЗаявкаНаСервис.Установить(мЗаявкаНаСервис);
			НаборЗаписейПродажиСервиса.Прочитать();
			НаборЗаписейПродажиСервиса.Очистить();
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписейПродажиСервиса.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Дата = ?(ЗначениеЗаполнено(ВремяНачала), ВремяНачала, ТекущаяДатаСеанса());
			КонецЦикла;
			
			НаборЗаписейПродажиСервиса.Записать();
		
		КонецЦикла;
		
	ИначеЕсли ПометкаУдаления Тогда
		УдалитьДвиженияПродажиСервиса();
	КонецЕсли;
	// Воробьев Д.А. 06.10.2016 16:40:41 --- 
	
КонецПроцедуры

Функция ПечатьСертификатаТО(Рекомендации = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("СертификатТО");
	ТабДок = Новый ТабличныйДокумент;
	
	Область = Макет.ПолучитьОбласть("Часть1");
	Область.Параметры.ДатаДокумента = ЭтотОбъект.Дата;
	Область.Параметры.ПробегАвтомобиля = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
	Область.Параметры.Автомобиль = Строка(Автомобиль.Модель) + " " + Строка(Автомобиль.VIN);
	
	ТабДок.Вывести(Область);
	
	Если ЗначениеЗаполнено(Рекомендации) Тогда
		
		Для Каждого Строк из Рекомендации Цикл
			
			Если НЕ ЗначениеЗаполнено(Строк.Работа) Тогда
				
				Продолжить;
				
			КонецЕсли;
		
			Область = Макет.ПолучитьОбласть("СтрокаРекомендации");
			Область.Параметры.Рекомендация = Строка(Строк.Работа);
			ТабДок.Вывести(Область);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Рекомендации");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Страница2Часть1");
	Область.Параметры.ДатаСледующегоТО = РегистрыСведений.Renault_ВыполнениеТО.ПолучитьПоследнийТО(Автомобиль);	
	Если ЗначениеЗаполнено(Автомобиль.VIN) Тогда //лучше вставить проверку на ВИН И Renault_АвтосервисОбщий.ЭтоАвтомобильРено(Автомобиль) Тогда
	
		ДанныеПродГарантии = Справочники.DMS_КарточкиКлиентов.НайтиДанныеПоVINАвтомобиля(Автомобиль.VIN);
		Если ЗначениеЗаполнено(ДанныеПродГарантии) Тогда
			
			Область.Параметры.ИнформацияОПродленнойГарантии = "Номер карты: " + Строка(ДанныеПродГарантии[0].НомерКарты)
			+ "; " + "дата окончания продленной гарантии: " + Строка(Формат(ДанныеПродГарантии[0].ДатаОкончанияРасшГарантии,"ДФ=dd.MM.yyyy"));
			
		Иначе
			
			Область.Параметры.ИнформацияОПродленнойГарантии = "Нет действующего контракта продленной гарантии"
			
		КонецЕсли;
		
	Иначе
		
		Область.Параметры.ИнформацияОПродленнойГарантии = "Нет действующего контракта продленной гарантии";
		
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ОбластьКонец");
	Область.Параметры.АдрессДЦ = ДилерскийЦентр.ОсновнойАдрес + "; " + Строка(ДилерскийЦентр.ОсновнойТелефон) + "; " + Строка(ДилерскийЦентр.ОсновнойEmail);
	
	ТабДок.Вывести(Область);
	
	Возврат ТабДок;
	
КонецФункции

// Воробьев Д.А. 06.10.2016 16:55:48 +++

Функция НайтиСвязанныеЗаявкиНаСервис()

	МассивЗаявок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |		ПО Renault_CRM_ВыдачаАвтомобиля.Обращение = Renault_CRM_ЗаявкаНаСервис.Обращение
	               |			И (Renault_CRM_ВыдачаАвтомобиля.Ссылка = &Ссылка)
	               |			И (НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивЗаявок.Добавить(Выборка.Ссылка);	
	КонецЦикла;

	Возврат МассивЗаявок;
	
КонецФункции // НайтиСвязаннуюЗаявкуНаСервис()

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УдалитьДвиженияПродажиСервиса();
КонецПроцедуры

Процедура УдалитьДвиженияПродажиСервиса()
	
	Заявки = НайтиСвязанныеЗаявкиНаСервис();
	
	Для каждого ЭлЗаявка Из Заявки Цикл
	
		НаборЗаписейПродажиСервиса = РегистрыСведений.Renault_СоставРаботПоЭтапам.СоздатьНаборЗаписей();
		НаборЗаписейПродажиСервиса.Отбор.Этап.Установить(3);
		НаборЗаписейПродажиСервиса.Отбор.ЗаявкаНаСервис.Установить(ЭлЗаявка);
		НаборЗаписейПродажиСервиса.Прочитать();
		НаборЗаписейПродажиСервиса.Очистить();
		НаборЗаписейПродажиСервиса.Записать();		
	
	КонецЦикла;

КонецПроцедуры

// Воробьев Д.А. 06.10.2016 16:55:48 ---
